DataProcessors/ТаблицаXML_ПланПоЦелевомуТрафикуСОктября2020.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>ТаблицаXML_ПланПоЦелевомуТрафикуСОктября2020</Name>
			<Comment>Используется для ввода плана по целевому трафику в учетную политику в параметр "РостовВиктор_ПланПоЦелевомуТрафику", который используется в отчете выполнение плана по целевому трафику</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеИзмерения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЗ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаЦелевая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗначения</Name>
					<Comment>Тип значения строкой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ТаблицаXML_ПланПоЦелевомуТрафикуСОктября2020/Ext/ObjectModule.bsl
Функция УстановитьНастройки() Экспорт
	
	РегистрСведений 	= ?(Не ЗначениеЗаполнено(РегистрСведений), 		"УчетнаяПолитика", 									РегистрСведений);
	Измерение 			= ?(Не ЗначениеЗаполнено(Измерение), 			"Параметр", 										Измерение); 
	Ресурс 				= ?(Не ЗначениеЗаполнено(Ресурс), 				"Значение", 										Ресурс);
	ЗначениеИзмерения 	= ?(Не ЗначениеЗаполнено (ЗначениеИзмерения), 	"РостовВиктор_ПланПоЦелевомуТрафикуСОктября2020", 	ЗначениеИзмерения)
КонецФункции

Функция ПолучиТекстИзРегистра() Экспорт	
	ЗначениеПоУмолчанию = "";
	
	Запрос = Новый Запрос("ВЫБРАТЬ Значение ИЗ РегистрСведений.УчетнаяПолитика.СрезПоследних(&Период, ) ГДЕ Параметр = &Измерение1"); 
	
	Запрос.Текст = ?(РегистрСведений <> "УчетнаяПолитика", 	 СтрЗаменить(Запрос.Текст, "УчетнаяПолитика", РегистрСведений), Запрос.Текст);
	Запрос.Текст = ?(Измерение <> "Параметр", 				 СтрЗаменить(Запрос.Текст, "Параметр", "Измерение"), 			Запрос.Текст);
	Запрос.Текст = ?(Ресурс <> "Значение",					 СтрЗаменить(Запрос.Текст, "Значение", "Ресурс"), 				Запрос.Текст); 
	
	Запрос.УстановитьПараметр("Период", 	ТекущаяДата());
	Запрос.УстановитьПараметр("Измерение1", ЗначениеИзмерения);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Рез = РезультатЗапроса.Выгрузить()[0][0];	
	Возврат Рез	
КонецФункции

Функция ЗаписатьВУчетнуюПолитику(Период, Параметр, Значение)
	
	НЗ = РегистрыСведений.УчетнаяПолитика.СоздатьНаборЗаписей();
	НЗ.Отбор.Период.Установить(Период);
	НЗ.Отбор.Параметр.Установить(Параметр);
	НЗ.Прочитать();
	
	Новая = НЗ.Добавить();
	Новая.Период 			= Период;
	Новая.Параметр 			= Параметр;
	Новая.ТипЗначения 		= "Строка";
	Новая.Значение 			= Значение;
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		НЗ.Записать();
		Результат = Истина;
	Исключение
		ЗаписьЖурналаРегистрации("Записать параметр учетной политики", УровеньЖурналаРегистрации.Ошибка, СтрШаблон("Период = %1, Параметр = %2, Значение = %3", Период, Параметр, Значение), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Результат = Ложь;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
КонецФункции

Процедура Сериализовать() Экспорт	
		
	Мас = Новый Массив();
	Для Каждого Зап Из ЭтотОбъект.ТЗ Цикл
		Структ = Новый Структура();
		Структ.Вставить("Месяц", 		Зап["Месяц"]);
		Структ.Вставить("ТочкаЦелевая", Зап["ТочкаЦелевая"]);
		Структ.Вставить("Направление",	Зап["Направление"]);
		Структ.Вставить("Количество", 	Зап["Количество"]);
		Мас.Добавить(Структ);
	КонецЦикла;
	
	
	ЗапXML = Новый ЗаписьXML();
	ЗапXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗапXML, Мас, НазначениеТипаXML.Явное);
	Стр = ЗапXML.Закрыть();

	ЗаписатьВУчетнуюПолитику(ТекущаяДата(), ЭтотОбъект.ЗначениеИзмерения, Стр);
	
КонецПроцедуры

Процедура Десериализовать() Экспорт
	
	ЭтотОбъект.ТЗ.Очистить();
	
	Стр = ПолучиТекстИзРегистра();
	
	ЧтXML = Новый ЧтениеXML();
	ЧтXML.УстановитьСтроку(Стр);
	Мас = СериализаторXDTO.ПрочитатьXML(ЧтXML);

	Для Каждого Эл Из Мас Цикл
		Новая = ЭтотОбъект.ТЗ.Добавить();
		
		Новая["Месяц"] 			= Эл["Месяц"];
		Новая["ТочкаЦелевая"] 	= Эл["ТочкаЦелевая"];
		Новая["Направление"]	= Эл["Направление"];
		Новая["Количество"] 	= Эл["Количество"];
	КонецЦикла;
	
	
КонецПроцедуры
